{
    "week": "2025-W37",
    "start_of_week": "2025-09-08T00:00:00",
    "end_of_week": "2025-09-14T23:59:59.999999",
    "article_count": 6,
    "sources": [
        "Techmeme",
        "MIT AI News"
    ],
    "articles": [
        {
            "id": "c34a07c0bc49ac38f1f87b50fa287ac6",
            "date": "Fri, 12 Sep 2025 10:05:02 -0400",
            "title": "Sources: the FTC is investigating whether Amazon and Google misled advertisers by not properly disclosing the terms and pricing for ads on their websites (Bloomberg)",
            "link": "http://www.techmeme.com/250912/p13#a250912p13",
            "description": "<a href=\"https://www.bloomberg.com/news/articles/2025-09-12/amazon-google-probed-by-ftc-over-search-advertising-practices\"><img align=\"RIGHT\" border=\"0\" hspace=\"4\" src=\"http://www.techmeme.com/250912/i13.jpg\" vspace=\"4\" /></a>\n<p><a href=\"http://www.techmeme.com/250912/p13#a250912p13\" title=\"Techmeme permalink\"><img height=\"12\" src=\"http://www.techmeme.com/img/pml.png\" style=\"border: none; padding: 0; margin: 0;\" width=\"11\" /></a> <a href=\"https://www.bloomberg.com/\">Bloomberg</a>:<br />\n<span style=\"font-size: 1.3em;\"><b><a href=\"https://www.bloomberg.com/news/articles/2025-09-12/amazon-google-probed-by-ftc-over-search-advertising-practices\">Sources: the FTC is investigating whether Amazon and Google misled advertisers by not properly disclosing the terms and pricing for ads on their websites</a></b></span>&nbsp; &mdash;&nbsp; The US Federal Trade Commission is investigating whether Amazon.com Inc. and Alphabet Inc.'s Google misled advertisers that place ads &hellip; </p>",
            "content": "Bloomberg:\nSources: the FTC is investigating whether Amazon and Google misled advertisers by not properly disclosing the terms and pricing for ads on their websites  —  The US Federal Trade Commission is investigating whether Amazon.com Inc. and Alphabet Inc.'s Google misled advertisers that place ads …",
            "week": "2025-W37",
            "source": "Techmeme",
            "processed_at": "2025-09-12T08:31:14.594478",
            "summary": "The FTC is investigating Amazon and Google for potentially misleading advertisers regarding undisclosed terms and pricing for ads on their platforms."
        },
        {
            "id": "ccd8e147fdb6850d74f341f864193120",
            "date": "Fri, 12 Sep 2025 09:40:03 -0400",
            "title": "Sources: India's Billionbrains Garage, parent of investment app Groww, plans to file for an India IPO next week, seeking $650M-$800M at an ~$8B valuation (Rajesh Mascarenhas/Bloomberg)",
            "link": "http://www.techmeme.com/250912/p12#a250912p12",
            "description": "<a href=\"https://www.bloomberg.com/news/articles/2025-09-12/microsoft-ceo-backed-groww-to-make-public-filing-for-india-ipo\"><img align=\"RIGHT\" border=\"0\" hspace=\"4\" src=\"http://www.techmeme.com/250912/i12.jpg\" vspace=\"4\" /></a>\n<p><a href=\"http://www.techmeme.com/250912/p12#a250912p12\" title=\"Techmeme permalink\"><img height=\"12\" src=\"http://www.techmeme.com/img/pml.png\" style=\"border: none; padding: 0; margin: 0;\" width=\"11\" /></a> Rajesh Mascarenhas / <a href=\"https://www.bloomberg.com/\">Bloomberg</a>:<br />\n<span style=\"font-size: 1.3em;\"><b><a href=\"https://www.bloomberg.com/news/articles/2025-09-12/microsoft-ceo-backed-groww-to-make-public-filing-for-india-ipo\">Sources: India's Billionbrains Garage, parent of investment app Groww, plans to file for an India IPO next week, seeking $650M-$800M at an ~$8B valuation</a></b></span>&nbsp; &mdash;&nbsp; Billionbrains Garage Ventures Ltd., the parent of India's largest investment platform Groww, is preparing to file for an initial public offering &hellip; </p>",
            "content": "Rajesh Mascarenhas / Bloomberg:\nSources: India's Billionbrains Garage, parent of investment app Groww, plans to file for an India IPO next week, seeking $650M-$800M at an ~$8B valuation  —  Billionbrains Garage Ventures Ltd., the parent of India's largest investment platform Groww, is preparing to file for an initial public offering …",
            "week": "2025-W37",
            "source": "Techmeme",
            "processed_at": "2025-09-12T08:31:14.594747",
            "summary": "Billionbrains Garage, the parent company of India's investment app Groww, is set to file for an IPO in India next week, aiming to raise between $650 million and $800 million at an estimated valuation of around $8 billion."
        },
        {
            "id": "ab47b76bbcc37336adb0f96faa306d34",
            "date": "Fri, 12 Sep 2025 08:45:00 -0400",
            "title": "Crypto trading volume at Bitstamp, bought by Robinhood in 2024, grew 21% MoM in August to $14.4B, surpassing Robinhood's crypto volume, which fell 18% to $13.7B (Brayden Lindrea/Cointelegraph)",
            "link": "http://www.techmeme.com/250912/p11#a250912p11",
            "description": "<a href=\"https://cointelegraph.com/news/bitstamp-flips-parent-robinhood-crypto-trading-volume\"><img align=\"RIGHT\" border=\"0\" hspace=\"4\" src=\"http://www.techmeme.com/250912/i11.jpg\" vspace=\"4\" /></a>\n<p><a href=\"http://www.techmeme.com/250912/p11#a250912p11\" title=\"Techmeme permalink\"><img height=\"12\" src=\"http://www.techmeme.com/img/pml.png\" style=\"border: none; padding: 0; margin: 0;\" width=\"11\" /></a> Brayden Lindrea / <a href=\"http://cointelegraph.com/\">Cointelegraph</a>:<br />\n<span style=\"font-size: 1.3em;\"><b><a href=\"https://cointelegraph.com/news/bitstamp-flips-parent-robinhood-crypto-trading-volume\">Crypto trading volume at Bitstamp, bought by Robinhood in 2024, grew 21% MoM in August to $14.4B, surpassing Robinhood's crypto volume, which fell 18% to $13.7B</a></b></span>&nbsp; &mdash;&nbsp; Bitstamp recorded a 21% rise in crypto trading volume to $14.4 billion in August, flipping Robinhood for the first time since it was acquired by the firm.</p>",
            "content": "Brayden Lindrea / Cointelegraph:\nCrypto trading volume at Bitstamp, bought by Robinhood in 2024, grew 21% MoM in August to $14.4B, surpassing Robinhood's crypto volume, which fell 18% to $13.7B  —  Bitstamp recorded a 21% rise in crypto trading volume to $14.4 billion in August, flipping Robinhood for the first time since it was acquired by the firm.",
            "week": "2025-W37",
            "source": "Techmeme",
            "processed_at": "2025-09-12T08:31:14.594968",
            "summary": "In August, Bitstamp's crypto trading volume surged by 21% to $14.4 billion, overtaking Robinhood's volume, which fell by 18% to $13.7 billion for the first time since Robinhood's acquisition of Bitstamp in 2024."
        },
        {
            "id": "5a319258cc64269956b84889d06d5b66",
            "date": "Fri, 12 Sep 2025 08:15:02 -0400",
            "title": "SK Hynix announces that it has completed development of HBM4, the next generation of high-bandwidth memory crucial for AI work; stock jumps 7% to a record high (Yoolim Lee/Bloomberg)",
            "link": "http://www.techmeme.com/250912/p10#a250912p10",
            "description": "<a href=\"https://www.bloomberg.com/news/articles/2025-09-12/sk-hynix-shares-hit-record-with-news-of-ai-memory-milestone\"><img align=\"RIGHT\" border=\"0\" hspace=\"4\" src=\"http://www.techmeme.com/250912/i10.jpg\" vspace=\"4\" /></a>\n<p><a href=\"http://www.techmeme.com/250912/p10#a250912p10\" title=\"Techmeme permalink\"><img height=\"12\" src=\"http://www.techmeme.com/img/pml.png\" style=\"border: none; padding: 0; margin: 0;\" width=\"11\" /></a> Yoolim Lee / <a href=\"https://www.bloomberg.com/\">Bloomberg</a>:<br />\n<span style=\"font-size: 1.3em;\"><b><a href=\"https://www.bloomberg.com/news/articles/2025-09-12/sk-hynix-shares-hit-record-with-news-of-ai-memory-milestone\">SK Hynix announces that it has completed development of HBM4, the next generation of high-bandwidth memory crucial for AI work; stock jumps 7% to a record high</a></b></span>&nbsp; &mdash;&nbsp; SK Hynix Inc.'s stock climbed 7% on Friday to a record after the company announced it had completed development of HBM4 &hellip; </p>",
            "content": "Yoolim Lee / Bloomberg:\nSK Hynix announces that it has completed development of HBM4, the next generation of high-bandwidth memory crucial for AI work; stock jumps 7% to a record high  —  SK Hynix Inc.'s stock climbed 7% on Friday to a record after the company announced it had completed development of HBM4 …",
            "week": "2025-W37",
            "source": "Techmeme",
            "processed_at": "2025-09-12T08:31:14.595184",
            "summary": "SK Hynix's stock surged 7% to a record high following the announcement of the completion of its next-generation high-bandwidth memory, HBM4, which is essential for AI applications."
        },
        {
            "id": "186f8876aa0f230bab16bc2940e8e915",
            "date": "Fri, 12 Sep 2025 07:15:01 -0400",
            "title": "Apple delays iPhone Air preorders in China, likely over eSIM regulatory issues, and replaces the launch schedule with \"release information to be updated later\" (Coco Feng/South China Morning Post)",
            "link": "http://www.techmeme.com/250912/p9#a250912p9",
            "description": "<a href=\"https://www.scmp.com/tech/big-tech/article/3325322/apple-postpones-iphone-air-release-china-beijing-keeps-tight-grip-esim-approval\"><img align=\"RIGHT\" border=\"0\" hspace=\"4\" src=\"http://www.techmeme.com/250912/i9.jpg\" vspace=\"4\" /></a>\n<p><a href=\"http://www.techmeme.com/250912/p9#a250912p9\" title=\"Techmeme permalink\"><img height=\"12\" src=\"http://www.techmeme.com/img/pml.png\" style=\"border: none; padding: 0; margin: 0;\" width=\"11\" /></a> Coco Feng / <a href=\"http://www.scmp.com/\">South China Morning Post</a>:<br />\n<span style=\"font-size: 1.3em;\"><b><a href=\"https://www.scmp.com/tech/big-tech/article/3325322/apple-postpones-iphone-air-release-china-beijing-keeps-tight-grip-esim-approval\">Apple delays iPhone Air preorders in China, likely over eSIM regulatory issues, and replaces the launch schedule with &ldquo;release information to be updated later&rdquo;</a></b></span>&nbsp; &mdash;&nbsp; Apple says all three state-owned telecoms network operators would provide eSIM support &lsquo;subject to regulatory approval&rsquo;</p>",
            "content": "Coco Feng / South China Morning Post:\nApple delays iPhone Air preorders in China, likely over eSIM regulatory issues, and replaces the launch schedule with “release information to be updated later”  —  Apple says all three state-owned telecoms network operators would provide eSIM support ‘subject to regulatory approval’",
            "week": "2025-W37",
            "source": "Techmeme",
            "processed_at": "2025-09-12T08:31:14.595416",
            "summary": "Apple has postponed iPhone Air preorders in China, potentially due to eSIM regulatory challenges, and will update the release schedule later as all three state-owned telecom operators await regulatory approval for eSIM support."
        },
        {
            "id": "5f5c7a382c69fa2b596fc3658fbffd1a",
            "date": "Wed, 10 Sep 2025 11:45:00 -0400",
            "title": "DOE selects MIT to establish a Center for the Exascale Simulation of Coupled High-Enthalpy Fluid–Solid Interactions",
            "link": "https://news.mit.edu/2025/mit-center-exascale-simulation-coupled-high-enthalpy-fluid-solid-interactions-0910",
            "description": "The research center, sponsored by the DOE’s National Nuclear Security Administration, will advance the simulation of extreme environments, such as those in hypersonic flight and atmospheric reentry.",
            "content": "The U.S. Department of Energy’s National Nuclear Security Administration (DOE/NNSA) recently announced that it has selected MIT to establish a new research center dedicated to advancing the predictive simulation of extreme environments, such as those encountered in hypersonic flight and atmospheric re-entry. The center will be part of the fourth phase of NNSA's Predictive Science Academic Alliance Program (PSAAP-IV), which supports frontier research advancing the predictive capabilities of high-performance computing for open science and engineering applications relevant to national security mission spaces.The Center for the Exascale Simulation of Coupled High-Enthalpy Fluid–Solid Interactions (CHEFSI) — a joint effort of the MIT Center for Computational Science and Engineering, the MIT Schwarzman College of Computing, and the MIT Institute for Soldier Nanotechnologies (ISN) — plans to harness cutting-edge exascale supercomputers and next-generation algorithms to simulate with unprecedented detail how extremely hot, fast-moving gaseous and solid materials interact. The understanding of these extreme environments — characterized by temperatures of more than 1,500 degrees Celsius and speeds as high as Mach 25 — and their effect on vehicles is central to national security, space exploration, and the development of advanced thermal protection systems.“CHEFSI will capitalize on MIT’s deep strengths in predictive modeling, high-performance computing, and STEM education to help ensure the United States remains at the forefront of scientific and technological innovation,” says Ian A. Waitz, MIT’s vice president for research. “The center’s particular relevance to national security and advanced technologies exemplifies MIT’s commitment to advancing research with broad societal benefit.”CHEFSI is one of five new Predictive Simulation Centers announced by the NNSA as part of a program expected to provide up to $17.5 million to each center over five years.CHEFSI’s research aims to couple detailed simulations of high-enthalpy gas flows with models of the chemical, thermal, and mechanical behavior of solid materials, capturing phenomena such as oxidation, nitridation, ablation, and fracture. Advanced computational models — validated by carefully designed experiments — can address the limitations of flight testing by providing critical insights into material performance and failure.“By integrating high-fidelity physics models with artificial intelligence-based surrogate models, experimental validation, and state-of-the-art exascale computational tools, CHEFSI will help us understand and predict how thermal protection systems perform under some of the harshest conditions encountered in engineering systems,” says Raúl Radovitzky, the Jerome C. Hunsaker Professor of Aeronautics and Astronautics, associate director of the ISN, and director of CHEFSI. “This knowledge will help in the design of resilient systems for applications ranging from reusable spacecraft to hypersonic vehicles.”Radovitzky will be joined on the center’s leadership team by Youssef Marzouk, the Breene M. Kerr (1951) Professor of Aeronautics and Astronautics, co-director of the MIT Center for Computational Science and Engineering (CCSE), and recently named the associate dean of the MIT Schwarzman College of Computing; and Nicolas Hadjiconstantinou, the Quentin Berg (1937) Professor of Mechanical Engineering and co-director of CCSE, who will serve as associate directors. The center co-principal investigators include MIT faculty members across the departments of Aeronautics and Astronautics, Electrical Engineering and Computer Science, Materials Science and Engineering, Mathematics, and Mechanical Engineering. Franklin Hadley will lead center operations, with administration and finance under the purview of Joshua Freedman. Hadley and Freedman are both members of the ISN headquarters team. CHEFSI expects to collaborate extensively with the DoE/NNSA national laboratories — Lawrence Livermore National Laboratory, Los Alamos National Laboratory, and Sandia National Laboratories — and, in doing so, offer graduate students and postdocs immersive research experiences and internships at these facilities.",
            "week": "2025-W37",
            "processed_at": "2025-09-10T13:37:36.455007",
            "source": "MIT AI News",
            "summary": "The U.S. Department of Energy's National Nuclear Security Administration has selected MIT to establish a new research center, CHEFSI, to advance predictive simulations of extreme environments using exascale supercomputers, which is critical for national security and the development of thermal protection systems for hypersonic flight and atmospheric re-entry."
        }
    ]
}